/*
 * Copyright (c) 2004, Laminar Research.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 *
 */

#include "MemFileUtils.h"
#include "FileUtils.h"
#include <stdio.h>
#include <ctype.h>
#include <stdarg.h>
#include <math.h>

/*
	TODO - level two analysis
	TODO - single file open handles zip, gz
	TODO - caching of open files in mem for all types of archives in case they are opened repeatedly
*/

/*
	UNIT TEST - DIR ITERATION

	FILE * fi = fopen("junk", "a");

	fprintf(fi, "Dumping Macintosh HD:code:\n");
	if (!IterateDirectory("Macintosh HD:code:", hacktoFile, fi))
		fprintf(fi,"Failed dumping dir.\n");
	fprintf(fi," ft=%d\n", GetFileType("Macintosh HD:code:", 0));

	fprintf(fi, "Dumping Macintosh HD:code\n");
	if (!IterateDirectory("Macintosh HD:code", hacktoFile, fi))
		fprintf(fi,"Failed dumping dir.\n");
	fprintf(fi," ft=%d\n", GetFileType("Macintosh HD:code", 0));

	fprintf(fi, "Dumping Macintosh HD:code:voiceserv\n");
	if (!IterateDirectory("Macintosh HD:code:voiceserv", hacktoFile, fi))
		fprintf(fi,"Failed dumping dir.\n");
	fprintf(fi," ft=%d\n", GetFileType("Macintosh HD:code:voiceserv", 0));

	fprintf(fi, "Dumping Macintosh HD:\n");
	if (!IterateDirectory("Macintosh HD:", hacktoFile, fi))
		fprintf(fi,"Failed dumping dir.\n");
	fprintf(fi," ft=%d\n", GetFileType("Macintosh HD:", 0));

	fprintf(fi, "Dumping Macintosh HD\n");
	if (!IterateDirectory("Macintosh HD", hacktoFile, fi))
		fprintf(fi,"Failed dumping dir.\n");
	fprintf(fi," ft=%d\n", GetFileType("Macintosh HD", 0));

	fprintf(fi, "Dumping Macintosh HD:joy_error.txt\n");
	if (!IterateDirectory("Macintosh HD:joy_error.txt", hacktoFile, fi))
		fprintf(fi,"Failed dumping dir.\n");
	fprintf(fi," ft=%d\n", GetFileType("Macintosh HD:joy_error.txt", 0));

	fclose(fi);

	UNIT TEST - TARBALLS

	static	void * UTTest_Open(const char * fname, void * ref)
	{
		printf("Starting file %s\n", fname);
		char * fi = (char *) malloc(strlen(fname)+1);
		strcpy(fi, fname);
		return fi;
	}
	static	int		UTTest_Print(const char * data, int len, void * ref, void * fi)
	{
		printf("%d -'%s'\n", len, data);
		return len;
	}
	static void		UTTest_Close(void * ref, void * fi)
	{
		printf("Closing %s\n", fi);
		free(fi);
	}
				MF_Untar(argv[++n], true, UTTest_Open, UTTest_Print, UTTest_Close, NULL);

*/

#if LIN || APL
		#include <dirent.h>
		#include <sys/stat.h>
		#define DIR_CHAR '/'
#elif IBM
	#define DIR_CHAR '\\'
	#include <sys/stat.h>
#else
	#error PLATFORM NOT DEFINED NEED DIR CHAR
#endif


#include <zlib.h>

#if LIN || APL
		#include <sys/types.h>
		#include <sys/mman.h>
		#include <unistd.h>
		#include <fcntl.h>
		#define bsd_open	 	open
		#define bsd_close 		close
		#define bsd_lseek 		lseek
		#define bsd_mmap	 	mmap
		#define bsd_munmap		munmap
		#define bsd_fstat 		fstat
#elif IBM
	#include <windows.h>
	#include "GUI_Unicode.h"
#else
	#error PLATFORM NOT DEFINED
#endif

#include <unzip.h>

#define REGTYPE	 '0'		/* regular file */
#define AREGTYPE '\0'		/* regular file */
#define LNKTYPE  '1'		/* link */
#define SYMTYPE  '2'		/* reserved */
#define CHRTYPE  '3'		/* character special */
#define BLKTYPE  '4'		/* block special */
#define DIRTYPE  '5'		/* directory */
#define FIFOTYPE '6'		/* FIFO special */
#define CONTTYPE '7'		/* reserved */

#define BLOCKSIZE 512

struct tar_header
{				/* byte offset */
  char name[100];		/*   0 */
  char mode[8];			/* 100 */
  char uid[8];			/* 108 */
  char gid[8];			/* 116 */
  char size[12];		/* 124 */
  char mtime[12];		/* 136 */
  char chksum[8];		/* 148 */
  char typeflag;		/* 156 */
  char linkname[100];		/* 157 */
  char magic[6];		/* 257 */
  char version[2];		/* 263 */
  char uname[32];		/* 265 */
  char gname[32];		/* 297 */
  char devmajor[8];		/* 329 */
  char devminor[8];		/* 337 */
  char prefix[155];		/* 345 */
				/* 500 */
};

union tar_buffer {
  char               buffer[BLOCKSIZE];
  struct tar_header  header;
};








struct	MFFileSet {

	MF_FileType			mType;			// Type of directory (directory, zip files, or gz tar ball.
	bool				mHasListing;	// Is the dir listing already loaded?
	string				mPath;			// Our path
	unzFile				mZipFile;		// The open zip archive for zip files
	vector<string>		mNames;			// Per file - filename
	vector<int>			mSizes;			// Per file - size of this file in bytes
	vector<char *>		mFileData;		// Per file - bytes of this file if pre-loaded (NULLs allowed to keep array ok.)
};

struct	MFMemFile {
	bool			mFree;	// True if we need to free memory when done.
	bool			mClose;	// True if we need to close our file descriptor.
	bool			mUnmap;	// True if we need to unmap memory.

	int				mFile;	// File descriptor
	const char *	mBegin;	// Span of memory the file is loaded into.
	const char *	mEnd;
#if IBM
	HANDLE 			mWinFile;
